calender/Startup_Progress.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Startup<sub>Progress</sub></title>
<!-- 2013-06-19 Wed 09:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
</head>
<body>
<div id="content">
<h1 class="title">Startup<sub>Progress</sub></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Purpose</a></li>
<li><a href="#sec-2">2. Read</a>
<ul>
<li><a href="#sec-2-1">2.1. JRuby Hacking Guide by nahi</a></li>
<li><a href="#sec-2-2">2.2. Copy of JRuby Source Code Reading Guide by nahi</a></li>
<li><a href="#sec-2-3">2.3. Ruboto Startup by donV</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Conclusion</a>
<ul>
<li><a href="#sec-3-1">3.1. Ruboto</a></li>
<li><a href="#sec-3-2">3.2. JRuby</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. org.jruby.*</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Purpose</h2>
<div class="outline-text-2" id="text-1">
<p>
Figure out Ruboto startup &amp; JRuby initialization on Dalvik
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Read</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <a href="http://prezi.com/tsuouxb3z4ln/jruby-hacking-guide/">JRuby Hacking Guide by nahi</a></h3>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <a href="http://prezi.com/n7jlwvldnfyu/copy-of-jruby-source-code-reading-guide/">Copy of JRuby Source Code Reading Guide by nahi</a></h3>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <a href="https://github.com/ruboto/ruboto/wiki/Ruboto-startup">Ruboto Startup by donV</a></h3>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Conclusion</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Ruboto</h3>
<div class="outline-text-3" id="text-3-1">
<p>
LauncherActivity -&gt; EntryPointActivity -&gt; RubotoActivity -&gt; android.app.Activity <br/>
</p>

<p>
JRuby is initialized in the EntryPointActivity class. <br/>
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> JRuby</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> org.jruby.*</h4>
<div class="outline-text-4" id="text-3-2-1">
</div><ol class="org-ol"><li>Main<br/><div class="outline-text-5" id="text-3-2-1-1">
<p>
Create JRuby instance, Entry
</p>
<div class="org-src-container">

<pre class="src src-java">    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">String</span>[] <span style="color: #eedd82;">args</span>) {
        doGCJCheck();

        <span style="color: #98fb98;">Main</span> <span style="color: #eedd82;">main</span>;

        <span style="color: #00ffff;">if</span> (<span style="color: #7fffd4;">DripMain</span>.DRIP_RUNTIME != <span style="color: #7fffd4;">null</span>) {
            main = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Main</span>(<span style="color: #7fffd4;">DripMain</span>.DRIP_CONFIG, <span style="color: #7fffd4;">true</span>);
        } <span style="color: #00ffff;">else</span> {
            main = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Main</span>(<span style="color: #7fffd4;">true</span>);
        }

        <span style="color: #00ffff;">try</span> {
            <span style="color: #98fb98;">Status</span> <span style="color: #eedd82;">status</span> = main.run(args);
            <span style="color: #00ffff;">if</span> (status.isExit()) {
                System.exit(status.getStatus());
            }
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">RaiseException</span> <span style="color: #eedd82;">rj</span>) {
            System.exit(handleRaiseException(rj));
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">Throwable</span> <span style="color: #eedd82;">t</span>) {
            <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">print out as a nice Ruby backtrace</span>
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">...</span>
        }
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Status</span> <span style="color: #87cefa;">run</span>(<span style="color: #98fb98;">String</span>[] <span style="color: #eedd82;">args</span>) {
        <span style="color: #00ffff;">try</span> {
            config.processArguments(args);
            <span style="color: #00ffff;">return</span> internalRun(); \\Here a JRuby VM is started
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">MainExitException</span> <span style="color: #eedd82;">mee</span>) {
            <span style="color: #00ffff;">return</span> handleMainExit(mee);
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">OutOfMemoryError</span> <span style="color: #eedd82;">oome</span>) {
            <span style="color: #00ffff;">return</span> handleOutOfMemory(oome);
        }
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">...</span>
}

    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">Status</span> <span style="color: #87cefa;">internalRun</span>() {
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">...        </span>
        doProcessArguments(in);
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">...        </span>
        <span style="color: #98fb98;">Ruby</span> <span style="color: #eedd82;">runtime</span>;
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">...</span>
    }
</pre>
</div>
</div>
</li>

<li>Ruby<br/><div class="outline-text-5" id="text-3-2-1-2">
<p>
Run JRuby VM and evaluate scripts
</p>
<ul class="org-ul">
<li>evaluateScript
</li>
</ul>
<div class="org-src-container">

<pre class="src src-java">    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">IRubyObject</span> <span style="color: #87cefa;">evalScriptlet</span>(<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">script</span>, <span style="color: #98fb98;">DynamicScope</span> <span style="color: #eedd82;">scope</span>) {
        <span style="color: #98fb98;">ThreadContext</span> <span style="color: #eedd82;">context</span> = getCurrentContext();
        <span style="color: #98fb98;">Node</span> <span style="color: #eedd82;">node</span> = parseEval(script, <span style="color: #ffa07a;">"&lt;script&gt;"</span>, scope, 0);

        <span style="color: #00ffff;">try</span> {
            context.preEvalScriptlet(scope);
            <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">ASTInterpreter</span>.INTERPRET_ROOT(<span style="color: #00ffff;">this</span>, context, node, context.getFrameSelf(), <span style="color: #7fffd4;">Block</span>.NULL_BLOCK);
        } <span style="color: #00ffff;">catch</span> (<span style="color: #7fffd4;">JumpException</span>.<span style="color: #98fb98;">ReturnJump</span> <span style="color: #eedd82;">rj</span>) {
            <span style="color: #00ffff;">throw</span> newLocalJumpError(<span style="color: #7fffd4;">RubyLocalJumpError</span>.<span style="color: #7fffd4;">Reason</span>.RETURN, (<span style="color: #98fb98;">IRubyObject</span>)rj.getValue(), <span style="color: #ffa07a;">"unexpected return"</span>);
        } <span style="color: #00ffff;">catch</span> (<span style="color: #7fffd4;">JumpException</span>.<span style="color: #98fb98;">BreakJump</span> <span style="color: #eedd82;">bj</span>) {
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">...</span>
        }
    }
</pre>
</div>


<ul class="org-ul">
<li>executeScript
</li>
</ul>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #98fb98;">IRubyObject</span> <span style="color: #87cefa;">executeScript</span>(<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">script</span>, <span style="color: #98fb98;">String</span> <span style="color: #eedd82;">filename</span>) {
    <span style="color: #98fb98;">byte</span>[] <span style="color: #eedd82;">bytes</span> = script.getBytes();

    <span style="color: #98fb98;">Node</span> <span style="color: #eedd82;">node</span> = parseInline(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ByteArrayInputStream</span>(bytes), filename, <span style="color: #7fffd4;">null</span>);
    <span style="color: #98fb98;">ThreadContext</span> <span style="color: #eedd82;">context</span> = getCurrentContext();

    <span style="color: #98fb98;">String</span> <span style="color: #eedd82;">oldFile</span> = context.getFile();
    <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">oldLine</span> = context.getLine();
    <span style="color: #00ffff;">try</span> {
        context.setFileAndLine(node.getPosition());
        <span style="color: #00ffff;">return</span> runInterpreter(node);
    } <span style="color: #00ffff;">finally</span> {
        context.setFileAndLine(oldFile, oldLine);
    }
}
</pre>
</div>
</div>
</li>
