calender/Startup_Progress.org
***** The object constructor
Set up a new JRuby runtime according to the properties of a specific RubyInstanceConfig object. I only leave lines with object initializing below.
#+begin_src java
    private Ruby(RubyInstanceConfig config) {
//...
        this.threadService      = new ThreadService(this);
        if(config.isSamplingEnabled()) {
            org.jruby.util.SimpleSampler.registerThreadContext(threadService.getCurrentContext());
        }
        
        getJRubyClassLoader(); // force JRubyClassLoader to init if possible
        
        if (config.getCompileMode() == CompileMode.OFFIR ||
                config.getCompileMode() == CompileMode.FORCEIR) {
            this.staticScopeFactory = new IRStaticScopeFactory(this);
        } else {
            this.staticScopeFactory = new StaticScopeFactory(this);
        }

        this.beanManager        = BeanManagerFactory.create(this, config.isManagementEnabled());
        this.jitCompiler        = new JITCompiler(this);
        this.parserStats        = new ParserStats(this);
        
//...Random 
        
        this.beanManager.register(new Config(this));
        this.beanManager.register(parserStats);
        this.beanManager.register(new ClassCache(this));
        this.beanManager.register(new org.jruby.management.Runtime(this));

        this.runtimeCache = new RuntimeCache();
        runtimeCache.initMethodCache(ClassIndex.MAX_CLASSES * MethodNames.values().length - 1);
        
        constantInvalidator = OptoFactory.newConstantInvalidator();
        checkpointInvalidator = OptoFactory.newConstantInvalidator();
//...
        reinitialize(false);
    }
#+end_src

***** init()
It seems that core classes and libraries are loaded from here. Maybe this could be a key entry for speeding up JRuby on Dalvik.

#+begin_src java
    private void init() {
        // Construct key services
//...
        // initialize the root of the class hierarchy completely
        initRoot();
        // Set up the main thread in thread service
        threadService.initMainThread();
        // Get the main threadcontext (gets constructed for us)
        ThreadContext tc = getCurrentContext();
        // Construct the top-level execution frame and scope for the main thread
        tc.prepareTopLevel(objectClass, topSelf);
        // Initialize all the core classes
        bootstrap();
        // set up defined messages
        initDefinedMessages();
        irManager = new IRManager();
        // Initialize the "dummy" class used as a marker
        dummyClass = new RubyClass(this, classClass);
        dummyClass.freeze(tc);
        
        // Create global constants and variables
        RubyGlobal.createGlobals(tc, this);

        // Prepare LoadService and load path
        getLoadService().init(config.getLoadPaths());

        // initialize builtin libraries
        initBuiltins();

        // load JRuby internals, which loads Java support
        // if we can't use reflection, 'jruby' and 'java' won't work; no load.
        boolean reflectionWorks;
        try {
            ClassLoader.class.getDeclaredMethod("getResourceAsStream", String.class);
            reflectionWorks = true;
        } catch (Exception e) {
            reflectionWorks = false;
        }
        
        if (!RubyInstanceConfig.DEBUG_PARSER && reflectionWorks) {
            loadService.require("jruby");
        }

        // out of base boot mode
        booting = false;
        
        // init Ruby-based kernel
        initRubyKernel();
//..        
    }
#+end_src

We can see that JRuby loads all core classes and builtin libs by invoking =bootstrap()= =initBuiltins()=

****** bootstrap()
It loads all ruby core classes, so we can't try to reduce its size.
