calender/Startup_Progress.html
<li>How a JRuby VM started<br/><ol class="org-ol"><li>The object constructor<br/><div class="outline-text-6" id="text-3-2-1-3-1">
<p>
Set up a new JRuby runtime according to the properties of a specific RubyInstanceConfig object. I only leave lines with object initializing below.
</p>
<div class="org-src-container">

<pre class="src src-java">    <span style="color: #00ffff;">private</span> Ruby(<span style="color: #98fb98;">RubyInstanceConfig</span> <span style="color: #eedd82;">config</span>) {
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">...</span>
        <span style="color: #00ffff;">this</span>.threadService      = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ThreadService</span>(<span style="color: #00ffff;">this</span>);
        <span style="color: #00ffff;">if</span>(config.isSamplingEnabled()) {
            <span style="color: #7fffd4;">org</span>.<span style="color: #7fffd4;">jruby</span>.<span style="color: #7fffd4;">util</span>.SimpleSampler.registerThreadContext(threadService.getCurrentContext());
        }

        getJRubyClassLoader(); <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">force JRubyClassLoader to init if possible</span>

        <span style="color: #00ffff;">if</span> (config.getCompileMode() == <span style="color: #7fffd4;">CompileMode</span>.OFFIR ||
                config.getCompileMode() == <span style="color: #7fffd4;">CompileMode</span>.FORCEIR) {
            <span style="color: #00ffff;">this</span>.staticScopeFactory = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">IRStaticScopeFactory</span>(<span style="color: #00ffff;">this</span>);
        } <span style="color: #00ffff;">else</span> {
            <span style="color: #00ffff;">this</span>.staticScopeFactory = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">StaticScopeFactory</span>(<span style="color: #00ffff;">this</span>);
        }

        <span style="color: #00ffff;">this</span>.beanManager        = BeanManagerFactory.create(<span style="color: #00ffff;">this</span>, config.isManagementEnabled());
        <span style="color: #00ffff;">this</span>.jitCompiler        = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">JITCompiler</span>(<span style="color: #00ffff;">this</span>);
        <span style="color: #00ffff;">this</span>.parserStats        = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ParserStats</span>(<span style="color: #00ffff;">this</span>);

<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">...Random </span>

        <span style="color: #00ffff;">this</span>.beanManager.register(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Config</span>(<span style="color: #00ffff;">this</span>));
        <span style="color: #00ffff;">this</span>.beanManager.register(parserStats);
        <span style="color: #00ffff;">this</span>.beanManager.register(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ClassCache</span>(<span style="color: #00ffff;">this</span>));
        <span style="color: #00ffff;">this</span>.beanManager.register(<span style="color: #00ffff;">new</span> <span style="color: #7fffd4;">org</span>.<span style="color: #7fffd4;">jruby</span>.<span style="color: #7fffd4;">management</span>.<span style="color: #98fb98;">Runtime</span>(<span style="color: #00ffff;">this</span>));

        <span style="color: #00ffff;">this</span>.runtimeCache = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">RuntimeCache</span>();
        runtimeCache.initMethodCache(<span style="color: #7fffd4;">ClassIndex</span>.MAX_CLASSES * MethodNames.values().length - 1);

        constantInvalidator = OptoFactory.newConstantInvalidator();
        checkpointInvalidator = OptoFactory.newConstantInvalidator();
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">...</span>
        reinitialize(<span style="color: #7fffd4;">false</span>);
    }
</pre>
</div>
</div>
</li>
<li>init()<br/><div class="outline-text-6" id="text-3-2-1-3-2">
<p>
It seems that core classes and libraries are loaded from here. Maybe this could be a key entry for speeding up JRuby on Dalvik.
</p>

<div class="org-src-container">

<pre class="src src-java">    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">init</span>() {
        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Construct key services</span>
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">...</span>
        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">initialize the root of the class hierarchy completely</span>
        initRoot();
        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Set up the main thread in thread service</span>
        threadService.initMainThread();
        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Get the main threadcontext (gets constructed for us)</span>
        <span style="color: #98fb98;">ThreadContext</span> <span style="color: #eedd82;">tc</span> = getCurrentContext();
        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Construct the top-level execution frame and scope for the main thread</span>
        tc.prepareTopLevel(objectClass, topSelf);
        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Initialize all the core classes</span>
        bootstrap();
        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">set up defined messages</span>
        initDefinedMessages();
        irManager = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">IRManager</span>();
        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Initialize the "dummy" class used as a marker</span>
        dummyClass = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">RubyClass</span>(<span style="color: #00ffff;">this</span>, classClass);
        dummyClass.freeze(tc);

        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Create global constants and variables</span>
        RubyGlobal.createGlobals(tc, <span style="color: #00ffff;">this</span>);

        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Prepare LoadService and load path</span>
        getLoadService().init(config.getLoadPaths());

        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">initialize builtin libraries</span>
        initBuiltins();

        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">load JRuby internals, which loads Java support</span>
        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">if we can't use reflection, 'jruby' and 'java' won't work; no load.</span>
        <span style="color: #98fb98;">boolean</span> <span style="color: #eedd82;">reflectionWorks</span>;
        <span style="color: #00ffff;">try</span> {
            ClassLoader.<span style="color: #00ffff;">class</span>.getDeclaredMethod(<span style="color: #ffa07a;">"getResourceAsStream"</span>, String.<span style="color: #00ffff;">class</span>);
            reflectionWorks = <span style="color: #7fffd4;">true</span>;
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">Exception</span> <span style="color: #eedd82;">e</span>) {
            reflectionWorks = <span style="color: #7fffd4;">false</span>;
        }

        <span style="color: #00ffff;">if</span> (!<span style="color: #7fffd4;">RubyInstanceConfig</span>.DEBUG_PARSER &amp;&amp; reflectionWorks) {
            loadService.require(<span style="color: #ffa07a;">"jruby"</span>);
        }

        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">out of base boot mode</span>
        booting = <span style="color: #7fffd4;">false</span>;

        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">init Ruby-based kernel</span>
        initRubyKernel();
<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">..        </span>
    }
</pre>
</div>

<p>
We can see that JRuby loads all core classes and builtin libs by invoking <code>bootstrap()</code> <code>initBuiltins()</code>
</p>
</div>

<ol class="org-ol"><li>bootstrap()<br/><div class="outline-text-7" id="text-3-2-1-3-2-1">
<p>
It loads all ruby core classes, so we can't try to reduce its size.
</p>
</div>
</li>

<li>initBuiltins()<br/><div class="outline-text-7" id="text-3-2-1-3-2-2">
<p>
