calender/Startup_Progress.html
When we go into the codes of <code>initBuiltins()</code>, we can find that JRuby loads quite a lot of ext libraries. Maybe there's something we can do with it.
</p>
<div class="org-src-container">

<pre class="src src-java">addLazyBuiltin(<span style="color: #ffa07a;">"java.rb"</span>, <span style="color: #ffa07a;">"java"</span>, <span style="color: #ffa07a;">"org.jruby.javasupport.Java"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"jruby.rb"</span>, <span style="color: #ffa07a;">"jruby"</span>, <span style="color: #ffa07a;">"org.jruby.ext.jruby.JRubyLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"jruby/util.rb"</span>, <span style="color: #ffa07a;">"jruby/util"</span>, <span style="color: #ffa07a;">"org.jruby.ext.jruby.JRubyUtilLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"jruby/type.rb"</span>, <span style="color: #ffa07a;">"jruby/type"</span>, <span style="color: #ffa07a;">"org.jruby.ext.jruby.JRubyTypeLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"iconv.jar"</span>, <span style="color: #ffa07a;">"iconv"</span>, <span style="color: #ffa07a;">"org.jruby.ext.iconv.IConvLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"nkf.jar"</span>, <span style="color: #ffa07a;">"nkf"</span>, <span style="color: #ffa07a;">"org.jruby.ext.nkf.NKFLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"stringio.jar"</span>, <span style="color: #ffa07a;">"stringio"</span>, <span style="color: #ffa07a;">"org.jruby.ext.stringio.StringIOLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"strscan.jar"</span>, <span style="color: #ffa07a;">"strscan"</span>, <span style="color: #ffa07a;">"org.jruby.ext.strscan.StringScannerLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"zlib.jar"</span>, <span style="color: #ffa07a;">"zlib"</span>, <span style="color: #ffa07a;">"org.jruby.ext.zlib.ZlibLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"enumerator.jar"</span>, <span style="color: #ffa07a;">"enumerator"</span>, <span style="color: #ffa07a;">"org.jruby.ext.enumerator.EnumeratorLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"readline.jar"</span>, <span style="color: #ffa07a;">"readline"</span>, <span style="color: #ffa07a;">"org.jruby.ext.readline.ReadlineService"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"thread.jar"</span>, <span style="color: #ffa07a;">"thread"</span>, <span style="color: #ffa07a;">"org.jruby.ext.thread.ThreadLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"thread.rb"</span>, <span style="color: #ffa07a;">"thread"</span>, <span style="color: #ffa07a;">"org.jruby.ext.thread.ThreadLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"digest.jar"</span>, <span style="color: #ffa07a;">"digest.so"</span>, <span style="color: #ffa07a;">"org.jruby.ext.digest.DigestLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"digest/md5.jar"</span>, <span style="color: #ffa07a;">"digest/md5"</span>, <span style="color: #ffa07a;">"org.jruby.ext.digest.MD5"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"digest/rmd160.jar"</span>, <span style="color: #ffa07a;">"digest/rmd160"</span>, <span style="color: #ffa07a;">"org.jruby.ext.digest.RMD160"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"digest/sha1.jar"</span>, <span style="color: #ffa07a;">"digest/sha1"</span>, <span style="color: #ffa07a;">"org.jruby.ext.digest.SHA1"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"digest/sha2.jar"</span>, <span style="color: #ffa07a;">"digest/sha2"</span>, <span style="color: #ffa07a;">"org.jruby.ext.digest.SHA2"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"bigdecimal.jar"</span>, <span style="color: #ffa07a;">"bigdecimal"</span>, <span style="color: #ffa07a;">"org.jruby.ext.bigdecimal.BigDecimalLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"io/wait.jar"</span>, <span style="color: #ffa07a;">"io/wait"</span>, <span style="color: #ffa07a;">"org.jruby.ext.io.wait.IOWaitLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"etc.jar"</span>, <span style="color: #ffa07a;">"etc"</span>, <span style="color: #ffa07a;">"org.jruby.ext.etc.EtcLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"weakref.rb"</span>, <span style="color: #ffa07a;">"weakref"</span>, <span style="color: #ffa07a;">"org.jruby.ext.weakref.WeakRefLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"delegate_internal.jar"</span>, <span style="color: #ffa07a;">"delegate_internal"</span>, <span style="color: #ffa07a;">"org.jruby.ext.delegate.DelegateLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"timeout.rb"</span>, <span style="color: #ffa07a;">"timeout"</span>, <span style="color: #ffa07a;">"org.jruby.ext.timeout.Timeout"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"ripper.jar"</span>, <span style="color: #ffa07a;">"ripper"</span>, <span style="color: #ffa07a;">"org.jruby.ext.ripper.RipperLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"socket.jar"</span>, <span style="color: #ffa07a;">"socket"</span>, <span style="color: #ffa07a;">"org.jruby.ext.socket.SocketLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"rbconfig.rb"</span>, <span style="color: #ffa07a;">"rbconfig"</span>, <span style="color: #ffa07a;">"org.jruby.ext.rbconfig.RbConfigLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"jruby/serialization.rb"</span>, <span style="color: #ffa07a;">"serialization"</span>, <span style="color: #ffa07a;">"org.jruby.ext.jruby.JRubySerializationLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"ffi-internal.jar"</span>, <span style="color: #ffa07a;">"ffi-internal"</span>, <span style="color: #ffa07a;">"org.jruby.ext.ffi.FFIService"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"tempfile.jar"</span>, <span style="color: #ffa07a;">"tempfile"</span>, <span style="color: #ffa07a;">"org.jruby.ext.tempfile.TempfileLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"fcntl.rb"</span>, <span style="color: #ffa07a;">"fcntl"</span>, <span style="color: #ffa07a;">"org.jruby.ext.fcntl.FcntlLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"rubinius.jar"</span>, <span style="color: #ffa07a;">"rubinius"</span>, <span style="color: #ffa07a;">"org.jruby.ext.rubinius.RubiniusLibrary"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"yecht.jar"</span>, <span style="color: #ffa07a;">"yecht"</span>, <span style="color: #ffa07a;">"YechtService"</span>);
addLazyBuiltin(<span style="color: #ffa07a;">"io/try_nonblock.jar"</span>, <span style="color: #ffa07a;">"io/try_nonblock"</span>, <span style="color: #ffa07a;">"org.jruby.ext.io.try_nonblock.IOTryNonblockLibrary"</span>);
<span style="color: #00ffff;">if</span> (is1_9()) {
    addLazyBuiltin(<span style="color: #ffa07a;">"mathn/complex.jar"</span>, <span style="color: #ffa07a;">"mathn/complex"</span>, <span style="color: #ffa07a;">"org.jruby.ext.mathn.Complex"</span>);
    addLazyBuiltin(<span style="color: #ffa07a;">"mathn/rational.jar"</span>, <span style="color: #ffa07a;">"mathn/rational"</span>, <span style="color: #ffa07a;">"org.jruby.ext.mathn.Rational"</span>);
    addLazyBuiltin(<span style="color: #ffa07a;">"fiber.rb"</span>, <span style="color: #ffa07a;">"fiber"</span>, <span style="color: #ffa07a;">"org.jruby.ext.fiber.FiberExtLibrary"</span>);
    addLazyBuiltin(<span style="color: #ffa07a;">"psych.jar"</span>, <span style="color: #ffa07a;">"psych"</span>, <span style="color: #ffa07a;">"org.jruby.ext.psych.PsychLibrary"</span>);
    addLazyBuiltin(<span style="color: #ffa07a;">"coverage.jar"</span>, <span style="color: #ffa07a;">"coverage"</span>, <span style="color: #ffa07a;">"org.jruby.ext.coverage.CoverageLibrary"</span>);
</pre>
</div>

<p>
Tracing back along the load chain, <code>org.jruby.runtime.load.LoadService#addBuiltinLibrary</code> -&gt; <code>org.jruby.runtime.load.Library#load</code> <br/>
<code>Library#load</code> is an interface and <code>LoadService</code> implemented it:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">load</span>(<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">file</span>, <span style="color: #98fb98;">boolean</span> <span style="color: #eedd82;">wrap</span>) {
    <span style="color: #98fb98;">long</span> <span style="color: #eedd82;">startTime</span> = loadTimer.startLoad(file);
    <span style="color: #00ffff;">try</span> {
        <span style="color: #00ffff;">if</span>(!runtime.getProfile().allowLoad(file)) {
            <span style="color: #00ffff;">throw</span> runtime.newLoadError(<span style="color: #ffa07a;">"no such file to load -- "</span> + file, file);
        }

        <span style="color: #98fb98;">SearchState</span> <span style="color: #eedd82;">state</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">SearchState</span>(file);
        state.prepareLoadSearch(file);

        <span style="color: #98fb98;">Library</span> <span style="color: #eedd82;">library</span> = findBuiltinLibrary(state, state.searchFile, state.suffixType);
        <span style="color: #00ffff;">if</span> (library == <span style="color: #7fffd4;">null</span>) library = findLibraryWithoutCWD(state, state.searchFile, state.suffixType);

        <span style="color: #00ffff;">if</span> (library == <span style="color: #7fffd4;">null</span>) {
            library = findLibraryWithClassloaders(state, state.searchFile, state.suffixType);
            <span style="color: #00ffff;">if</span> (library == <span style="color: #7fffd4;">null</span>) {
                <span style="color: #00ffff;">throw</span> runtime.newLoadError(<span style="color: #ffa07a;">"no such file to load -- "</span> + file, file);
            }
        }
        <span style="color: #00ffff;">try</span> {
            library.load(runtime, wrap);
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">IOException</span> <span style="color: #eedd82;">e</span>) {
            <span style="color: #00ffff;">if</span> (runtime.getDebug().isTrue()) e.printStackTrace(runtime.getErr());
            <span style="color: #00ffff;">throw</span> newLoadErrorFromThrowable(runtime, file, e);
        }
    } <span style="color: #00ffff;">finally</span> {
        loadTimer.endLoad(file, startTime);
    }
}
</pre>
</div>
<p>
It seems that JRuby has a loadTimer but without displaying library loadtime in default. I'm going to find how to get the loadtime of every library and decide which could be reduced or just optimized.
</p>
</div>
</li></ol>
</li></ol>
</li></ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2013-06-19 Wed 09:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.3)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
